Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_busctrl.h
#define BUSCTRL_PERFCTR1_PERFCTR1                               (0xFFFFFFu<<0)
#define BUSCTRL_PERFCTR1_PERFCTR1_0                             (0x1u<<0)

// PERFSEL1 Configuration

#define BUSCTRL_PERFSEL1_PERFSEL1                               (0x7Fu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_0                             (0x1u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC1_STALL_UPSTREAM     (0x0u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC1_STALL_DOWNSTREAM   (0x1u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC1_ACCESS_CONTESTED   (0x2u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC1_ACCESS             (0x3u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC0_STALL_UPSTREAM     (0x4u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC0_STALL_DOWNSTREAM   (0x5u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC0_ACCESS_CONTESTED   (0x6u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SIOB_PROC0_ACCESS             (0x7u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_APB_STALL_UPSTREAM            (0x8u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_APB_STALL_DOWNSTREAM          (0x9u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_APB_ACCESS_CONTESTED          (0xAu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_APB_ACCESS                    (0xBu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_FASTPERI_STALL_UPSTREAM       (0xCu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_FASTPERI_STALL_DOWNSTREAM     (0xDu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_FASTPERI_ACCESS_CONTESTED     (0xEu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_FASTPERI_ACCESS               (0xFu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM9_STALL_UPSTREAM          (0x10u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM9_STALL_DOWNSTREAM        (0x11u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM9_ACCESS_CONTESTED        (0x12u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM9_ACCESS                  (0x13u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM8_STALL_UPSTREAM          (0x14u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM8_STALL_DOWNSTREAM        (0x15u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM8_ACCESS_CONTESTED        (0x16u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM8_ACCESS                  (0x17u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM7_STALL_UPSTREAM          (0x18u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM7_STALL_DOWNSTREAM        (0x19u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM7_ACCESS_CONTESTED        (0x1Au<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM7_ACCESS                  (0x1Bu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM6_STALL_UPSTREAM          (0x1Cu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM6_STALL_DOWNSTREAM        (0x1Du<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM6_ACCESS_CONTESTED        (0x1Eu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM6_ACCESS                  (0x1Fu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM5_STALL_UPSTREAM          (0x20u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM5_STALL_DOWNSTREAM        (0x21u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM5_ACCESS_CONTESTED        (0x22u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM5_ACCESS                  (0x23u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM4_STALL_UPSTREAM          (0x24u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM4_STALL_DOWNSTREAM        (0x25u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM4_ACCESS_CONTESTED        (0x26u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM4_ACCESS                  (0x27u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM3_STALL_UPSTREAM          (0x28u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM3_STALL_DOWNSTREAM        (0x29u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM3_ACCESS_CONTESTED        (0x2Au<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM3_ACCESS                  (0x2Bu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM2_STALL_UPSTREAM          (0x2Cu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM2_STALL_DOWNSTREAM        (0x2Du<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM2_ACCESS_CONTESTED        (0x2Eu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM2_ACCESS                  (0x2Fu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM1_STALL_UPSTREAM          (0x30u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM1_STALL_DOWNSTREAM        (0x31u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM1_ACCESS_CONTESTED        (0x32u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM1_ACCESS                  (0x33u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM0_STALL_UPSTREAM          (0x34u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM0_STALL_DOWNSTREAM        (0x35u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM0_ACCESS_CONTESTED        (0x36u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_SRAM0_ACCESS                  (0x37u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN1_STALL_UPSTREAM      (0x38u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN1_STALL_DOWNSTREAM    (0x39u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN1_ACCESS_CONTESTED    (0x3Au<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN1_ACCESS              (0x3Bu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN0_STALL_UPSTREAM      (0x3Cu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN0_STALL_DOWNSTREAM    (0x3Du<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN0_ACCESS_CONTESTED    (0x3Eu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_XIP_MAIN0_ACCESS              (0x3Fu<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_ROM_STALL_UPSTREAM            (0x40u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_ROM_STALL_DOWNSTREAM          (0x41u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_ROM_ACCESS_CONTESTED          (0x42u<<0)
#define BUSCTRL_PERFSEL1_PERFSEL1_ROM_ACCESS                    (0x43u<<0)

// PERFCTR2 Configuration

#define BUSCTRL_PERFCTR2_PERFCTR2                               (0xFFFFFFu<<0)
#define BUSCTRL_PERFCTR2_PERFCTR2_0                             (0x1u<<0)

// PERFSEL2 Configuration

#define BUSCTRL_PERFSEL2_PERFSEL2                               (0x7Fu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_0                             (0x1u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC1_STALL_UPSTREAM     (0x0u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC1_STALL_DOWNSTREAM   (0x1u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC1_ACCESS_CONTESTED   (0x2u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC1_ACCESS             (0x3u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC0_STALL_UPSTREAM     (0x4u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC0_STALL_DOWNSTREAM   (0x5u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC0_ACCESS_CONTESTED   (0x6u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SIOB_PROC0_ACCESS             (0x7u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_APB_STALL_UPSTREAM            (0x8u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_APB_STALL_DOWNSTREAM          (0x9u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_APB_ACCESS_CONTESTED          (0xAu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_APB_ACCESS                    (0xBu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_FASTPERI_STALL_UPSTREAM       (0xCu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_FASTPERI_STALL_DOWNSTREAM     (0xDu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_FASTPERI_ACCESS_CONTESTED     (0xEu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_FASTPERI_ACCESS               (0xFu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM9_STALL_UPSTREAM          (0x10u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM9_STALL_DOWNSTREAM        (0x11u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM9_ACCESS_CONTESTED        (0x12u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM9_ACCESS                  (0x13u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM8_STALL_UPSTREAM          (0x14u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM8_STALL_DOWNSTREAM        (0x15u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM8_ACCESS_CONTESTED        (0x16u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM8_ACCESS                  (0x17u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM7_STALL_UPSTREAM          (0x18u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM7_STALL_DOWNSTREAM        (0x19u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM7_ACCESS_CONTESTED        (0x1Au<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM7_ACCESS                  (0x1Bu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM6_STALL_UPSTREAM          (0x1Cu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM6_STALL_DOWNSTREAM        (0x1Du<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM6_ACCESS_CONTESTED        (0x1Eu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM6_ACCESS                  (0x1Fu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM5_STALL_UPSTREAM          (0x20u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM5_STALL_DOWNSTREAM        (0x21u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM5_ACCESS_CONTESTED        (0x22u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM5_ACCESS                  (0x23u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM4_STALL_UPSTREAM          (0x24u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM4_STALL_DOWNSTREAM        (0x25u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM4_ACCESS_CONTESTED        (0x26u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM4_ACCESS                  (0x27u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM3_STALL_UPSTREAM          (0x28u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM3_STALL_DOWNSTREAM        (0x29u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM3_ACCESS_CONTESTED        (0x2Au<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM3_ACCESS                  (0x2Bu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM2_STALL_UPSTREAM          (0x2Cu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM2_STALL_DOWNSTREAM        (0x2Du<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM2_ACCESS_CONTESTED        (0x2Eu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM2_ACCESS                  (0x2Fu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM1_STALL_UPSTREAM          (0x30u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM1_STALL_DOWNSTREAM        (0x31u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM1_ACCESS_CONTESTED        (0x32u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM1_ACCESS                  (0x33u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM0_STALL_UPSTREAM          (0x34u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM0_STALL_DOWNSTREAM        (0x35u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM0_ACCESS_CONTESTED        (0x36u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_SRAM0_ACCESS                  (0x37u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN1_STALL_UPSTREAM      (0x38u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN1_STALL_DOWNSTREAM    (0x39u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN1_ACCESS_CONTESTED    (0x3Au<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN1_ACCESS              (0x3Bu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN0_STALL_UPSTREAM      (0x3Cu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN0_STALL_DOWNSTREAM    (0x3Du<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN0_ACCESS_CONTESTED    (0x3Eu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_XIP_MAIN0_ACCESS              (0x3Fu<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_ROM_STALL_UPSTREAM            (0x40u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_ROM_STALL_DOWNSTREAM          (0x41u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_ROM_ACCESS_CONTESTED          (0x42u<<0)
#define BUSCTRL_PERFSEL2_PERFSEL2_ROM_ACCESS                    (0x43u<<0)

// PERFCTR3 Configuration

#define BUSCTRL_PERFCTR3_PERFCTR3                               (0xFFFFFFu<<0)
#define BUSCTRL_PERFCTR3_PERFCTR3_0                             (0x1u<<0)

// PERFSEL3 Configuration

#define BUSCTRL_PERFSEL3_PERFSEL3                               (0x7Fu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_0                             (0x1u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC1_STALL_UPSTREAM     (0x0u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC1_STALL_DOWNSTREAM   (0x1u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC1_ACCESS_CONTESTED   (0x2u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC1_ACCESS             (0x3u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC0_STALL_UPSTREAM     (0x4u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC0_STALL_DOWNSTREAM   (0x5u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC0_ACCESS_CONTESTED   (0x6u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SIOB_PROC0_ACCESS             (0x7u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_APB_STALL_UPSTREAM            (0x8u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_APB_STALL_DOWNSTREAM          (0x9u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_APB_ACCESS_CONTESTED          (0xAu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_APB_ACCESS                    (0xBu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_FASTPERI_STALL_UPSTREAM       (0xCu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_FASTPERI_STALL_DOWNSTREAM     (0xDu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_FASTPERI_ACCESS_CONTESTED     (0xEu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_FASTPERI_ACCESS               (0xFu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM9_STALL_UPSTREAM          (0x10u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM9_STALL_DOWNSTREAM        (0x11u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM9_ACCESS_CONTESTED        (0x12u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM9_ACCESS                  (0x13u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM8_STALL_UPSTREAM          (0x14u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM8_STALL_DOWNSTREAM        (0x15u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM8_ACCESS_CONTESTED        (0x16u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM8_ACCESS                  (0x17u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM7_STALL_UPSTREAM          (0x18u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM7_STALL_DOWNSTREAM        (0x19u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM7_ACCESS_CONTESTED        (0x1Au<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM7_ACCESS                  (0x1Bu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM6_STALL_UPSTREAM          (0x1Cu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM6_STALL_DOWNSTREAM        (0x1Du<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM6_ACCESS_CONTESTED        (0x1Eu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM6_ACCESS                  (0x1Fu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM5_STALL_UPSTREAM          (0x20u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM5_STALL_DOWNSTREAM        (0x21u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM5_ACCESS_CONTESTED        (0x22u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM5_ACCESS                  (0x23u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM4_STALL_UPSTREAM          (0x24u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM4_STALL_DOWNSTREAM        (0x25u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM4_ACCESS_CONTESTED        (0x26u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM4_ACCESS                  (0x27u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM3_STALL_UPSTREAM          (0x28u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM3_STALL_DOWNSTREAM        (0x29u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM3_ACCESS_CONTESTED        (0x2Au<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM3_ACCESS                  (0x2Bu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM2_STALL_UPSTREAM          (0x2Cu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM2_STALL_DOWNSTREAM        (0x2Du<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM2_ACCESS_CONTESTED        (0x2Eu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM2_ACCESS                  (0x2Fu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM1_STALL_UPSTREAM          (0x30u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM1_STALL_DOWNSTREAM        (0x31u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM1_ACCESS_CONTESTED        (0x32u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM1_ACCESS                  (0x33u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM0_STALL_UPSTREAM          (0x34u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM0_STALL_DOWNSTREAM        (0x35u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM0_ACCESS_CONTESTED        (0x36u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_SRAM0_ACCESS                  (0x37u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN1_STALL_UPSTREAM      (0x38u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN1_STALL_DOWNSTREAM    (0x39u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN1_ACCESS_CONTESTED    (0x3Au<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN1_ACCESS              (0x3Bu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN0_STALL_UPSTREAM      (0x3Cu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN0_STALL_DOWNSTREAM    (0x3Du<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN0_ACCESS_CONTESTED    (0x3Eu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_XIP_MAIN0_ACCESS              (0x3Fu<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_ROM_STALL_UPSTREAM            (0x40u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_ROM_STALL_DOWNSTREAM          (0x41u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_ROM_ACCESS_CONTESTED          (0x42u<<0)
#define BUSCTRL_PERFSEL3_PERFSEL3_ROM_ACCESS                    (0x43u<<0)
